{
    "ServiceNavBar" : {
        "subMenu": {
            "0" : "Fly Office",
            "1" : "การจัดการสมาชิกโรงแรม",
            "2" : "การจัดการงานทีม"
        }
    },
    "Menu" : {
        "service": {
            "0" : "Fly Office",
            "1" : "การจัดการสมาชิกโรงแรม",
            "2" : "การจัดการงานทีม"
        },
        "solutions": {
            "0" : "ระบบบริหารจัดการแฟรนไชส์",
            "1" : "ระบบจัดการจัดซื้ออิเล็กทรอนิกส์",
            "2" : "ระบบจัดการแรงงาน"
        },
        "devices": {
            "0": "LG",
            "1": "SK Hynix",
            "2": "ZMODEM",
            "3": "SK",
            "4": "ซัมซุง",
            "5": "JT",
            "6": "อื่นๆ"
        }
    },
    "LandingPage": {
        "heroSection": {
            "headingTitle": "2FC will put wings on your company.",
            "headingSubTitle": "TFC พร้อมเติมปีกแห่ง IT ให้กับธุรกิจของคุณ",
            "bannerHeading": "2FC ได้ดำเนินโครงการ 100 โครงการกับลูกค้า 10 รายเรียบร้อยแล้ว"
        },
        "conceptSection": {
            "headingTitle": "กรอบงาน 2FC ทำให้ระบบไอทีง่ายขึ้น",
            "headingSubTitle": "2FC แก้ปัญหาไอทีของลูกค้าได้อย่างรวดเร็ว ด้วยความเชี่ยวชาญและเทคโนโลยีระดับมืออาชีพ",
            "ITService": {
                "title": "บริการไอที",
                "description": "เข้าใจความต้องการลูกค้า มอบบริการครบวงจรตั้งแต่พัฒนา ถึงการดำเนินงาน",
                "summaries": {
                "0": "วิเคราะห์ความต้องการและให้คำแนะนำ",
                "1": "ออกแบบและพัฒนาระบบเฉพาะ",
                "2": "บำรุงรักษาและสนับสนุนเทคนิค"
                }
            },
            "Solutions": {
                "title": "โซลูชัน",
                "description": "ด้วยเฟรมเวิร์กเฉพาะที่สั่งสม เรามอบโซลูชันที่รวดเร็วและง่ายดาย",
                "summaries": {
                "0": "โซลูชันรวดเร็ว",
                "1": "การออกแบบใช้งานง่าย",
                "2": "อัตโนมัติด้วยเฟรมเวิร์ก"
                }
            },
            "Devices": {
                "title": "อุปกรณ์",
                "description": "เชี่ยวชาญด้านการสื่อสารอุปกรณ์ มอบระบบที่แม่นยำและเสถียร",
                "summaries": {
                "0": "พัฒนาการสื่อสารอุตสาหกรรม",
                "1": "รองรับโปรโตคอลอุตสาหกรรม",
                "2": "บูรณาการจากมิดเดิลแวร์ถึงแอป"
                }
            }
        },
        "featuredProjectsSection": {
            "project1": {
                "category": "HaruFilm",
                "title": "Haru Film",
                "subtitle": "พัฒนา Self-Photo Studio",
                "description": "ระบบถ่ายภาพด้วยตนเองหลายภาษา ติดตั้งกว่า 500 สาขา รองรับการจัดการและมอนิเตอร์แบบเรียลไทม์"
            },
            "project2": {
                "category": "CAZ",
                "title": "CAZ Thailand",
                "subtitle": "พัฒนา HR System",
                "description": "จัดการบุคคลครบวงจร ตั้งแต่ข้อมูล การทำงาน ประเมินผล สรรหา โอนย้าย ออกงาน ถึงเงินเดือนและรายงาน"
            },
            "project3": {
                "category": "2FCFlyOffice",
                "title": "2FC",
                "subtitle": "พัฒนา Fly Office",
                "description": "จัดการคำขอซื้อวัสดุครบขั้นตอน ตั้งแต่อนุมัติ ออกใบสั่ง รับเข้า ถึงใบกำกับและการชำระ เชื่อมต่อกรมสรรพากรและธนาคาร"
            },
            "project4": {
                "category": "SamsungKiheung",
                "title": "Samsung Kiheung",
                "subtitle": "พัฒนา Middleware รถเข็นอัตโนมัติ",
                "description": "คอนโทรลเลอร์ย้ายกล่องในกระบวนการผลิต รองรับการควบคุมอุปกรณ์ การสื่อสารไร้สาย และการบันทึก Log"
            },
            "project5": {
                "category": "LGEngergy",
                "title": "LG Energy Solution",
                "subtitle": "พัฒนา Middleware",
                "description": "คอนโทรลเลอร์อัตโนมัติสำหรับการผลิตแบตเตอรี่ รองรับ RFID การส่งข้อมูล และการบันทึกการสื่อสาร"
            },
            "project6": {
                "category": "SKHynics",
                "title": "SK hynix",
                "subtitle": "พัฒนา Middleware SECS",
                "description": "คอนโทรลเลอร์ควบคุมอุปกรณ์ในสายการผลิต รองรับการเริ่มต้นอุปกรณ์ แจ้งสถานะ และการสื่อสาร"
            },
            "project7": {
                "category": "SamsungKiheung",
                "title": "Samsung Kiheung",
                "subtitle": "พัฒนา Middleware รถเข็นอัตโนมัติ",
                "description": "คอนโทรลเลอร์ย้ายกล่องในกระบวนการผลิต รองรับการควบคุมอุปกรณ์ การสื่อสารไร้สาย และการบันทึก Log"
            },
            "project8": {
                "category": "LGEngergy",
                "title": "LG Energy Solution",
                "subtitle": "พัฒนา Middleware",
                "description": "คอนโทรลเลอร์อัตโนมัติสำหรับการผลิตแบตเตอรี่ รองรับ RFID การส่งข้อมูล และการบันทึกการสื่อสาร"
            },
            "project9": {
                "category": "SKHynics",
                "title": "SK hynix",
                "subtitle": "พัฒนา Middleware SECS",
                "description": "คอนโทรลเลอร์ควบคุมอุปกรณ์ในสายการผลิต รองรับการเริ่มต้นอุปกรณ์ แจ้งสถานะ และการสื่อสาร"
            }
        }, 
        "technologyStackSection": {
            "headingTitle": "สแต็กเทคโนโลยี"
        },
        "flyFrameworkSection": {
            "headingTitle": "Fly Framework",
            "headingSubTitle": "เฟรมเวิร์กของ 2FC พัฒนาขึ้นจากประสบการณ์กว่า 13 ปีในการสร้างระบบหลากหลายรูปแบบ มอบโซลูชันที่ปรับแต่งได้ตรงกับความต้องการของธุรกิจ",
            "Speed": {
                "title": "พัฒนาได้รวดเร็ว",
                "description": "เพิ่มความเร็วในการพัฒนา ด้วยเทมเพลตฟังก์ชันที่ใช้บ่อย เช่น CRUD และการค้นหา"
            }, 
            "CostSaving": {
                "title": "ประหยัดค่าใช้จ่าย",
                "description": "ลดต้นทุนการพัฒนา ด้วยการนำโมดูลมาตรฐานที่ผ่านการตรวจสอบแล้วกลับมาใช้ซ้ำ"
            },
            "Integration": {
                "title": "รองรับการเชื่อมต่อภายนอก",
                "description": "มีฟังก์ชันการเชื่อมต่อกับกรมสรรพากร ธนาคาร ERP และอื่น ๆ มาให้อย่างครบถ้วน"
            }, 
            "Component": {
                "title": "โครงสร้างแบบคอมโพเนนต์",
                "description": "ออกแบบทั้งฝั่ง Frontend และ Backend แบบคอมโพเนนต์ ทำให้ง่ายต่อการดูแลและบำรุงรักษา"
            }, 
            "Operations": {
                "title": "ฟังก์ชันการใช้งานครบถ้วน",
                "description": "มีฟังก์ชันสำคัญสำหรับการปฏิบัติงาน เช่น การจัดการสิทธิ์ การติดตามประวัติ และการตั้งค่าเมนู ติดตั้งมาให้พร้อม"
            }  
        },
        "leadershipSection": {
            "headingTitle": "ภาวะผู้นำ",
            "headingSubTitle": "ทีมของเราให้ความสำเร็จของลูกค้าเป็นคุณค่าสูงสุด ด้วยเป้าหมายที่ชัดเจนและการลงมือทำที่มั่นใจ เราสร้างทุกความเป็นไปได้ให้เป็นความจริง"
        }, 
        "footer": {
            "address": "ชั้น 13 ห้อง 11 เลขที่ 33 ถนนกุกแจคึมยุงโร 6-กิล เขตยองดึงโพ กรุงโซล"
        }
    },
    "ContactPage": {
        "contactSection": {
        "headingTitle": "Contact",
        "headingSubTitle": "เมื่อทำงานร่วมกับผู้เชี่ยวชาญของ 2FC ทีม IT ของบริษัทคุณจะสมบูรณ์แบบ",
        "address": "ชั้น 13 ห้อง 11 เลขที่ 33 ถนนกุกแจคึมยุงโร 6-กิล เขตยองดึงโพ กรุงโซล"
        }
    },
    "AboutPage": {
        "aboutUsSection": {
            "greeting1": {
                "0": "ขอขอบคุณลูกค้าทุกท่านที่เข้ามาเยี่ยมชมเว็บไซต์ของเราอย่างจริงใจ", 
                "1": "เทคโนโลยีอย่าง AI และ Web3 กำลังเปลี่ยนแปลงอย่างรวดเร็ว สภาพแวดล้อมด้าน IT ของธุรกิจก็เปลี่ยนไปอย่างรวดเร็วเช่นกัน", 
                "2": "2FC มุ่งมั่นที่จะคิดและแก้ปัญหาร่วมกับลูกค้า เพื่อค้นหาคำตอบที่เข้าใจง่ายและใช้ได้จริง"
            },
            "greeting2": {
                "0": "ตั้งแต่เริ่มพัฒนาโครงการ CTI ที่อินโดนีเซียในปี 2009 เราได้ทำงานร่วมกับบริษัททั้งในและต่างประเทศสำเร็จมาแล้วหลายโครงการ", 
                "1": "ด้วยความเชี่ยวชาญในการพัฒนาเว็บและมือถือ เราจึงให้บริการได้ทั้งโซลูชันเฉพาะทาง เช่น การสื่อสารกับอุปกรณ์ รวมถึงโมดูลบริการที่ปรับใช้ได้ง่าย", 
                "2": "ด้วยประสบการณ์และเทคโนโลยีที่สั่งสมมา การพัฒนาในต้นทุนที่ลดลง และการบำรุงรักษาอย่างต่อเนื่อง เราจะช่วยให้การลงทุนด้าน IT ของคุณประสบความสำเร็จ", 
                "3": "เราจะเติบโตไปพร้อมกับลูกค้า และเป็นพันธมิตรที่เชื่อถือได้ตลอดไป"
            }
        }, 
        "introductionSection": {
            "headingTitle": "แนะนำบริษัท",
            "introdction1": {
                "title": "ชื่อบริษัท", 
                "description": "บริษัท ทูเอฟซี จำกัด"
            },
            "introdction2": {
                "title": "CEO", 
                "description": "อี ซุน ฮง (Lee Soon Hong)"
            },
            "introdction3": {
                "title": "วันที่ก่อตั้ง", 
                "description": "5 พฤศจิกายน 2009\nจดทะเบียนเป็นนิติบุคคลเมื่อ 6 กุมภาพันธ์ 2014"
            },
            "introdction4": {
                "title": "ประเภทธุรกิจ", 
                "description": "พัฒนาและจัดจำหน่ายซอฟต์แวร์ประยุกต์"
            },
            "introdction5": {
                "title": "ธุรกิจหลัก", 
                "description": "พัฒนาระบบ IT แบบกำหนดเอง\nพัฒนาการสื่อสารระหว่างอุปกรณ์\nจำหน่ายและให้เช่าโซลูชัน\nพัฒนาเว็บสำหรับมือถือ\nบริการบำรุงรักษา เป็นต้น"
            },
            "introdction6": {
                "title": "ที่อยู่", 
                "description": "33 ถนนกุกเจกึมยองโร 6-กิล แขวงยองดึงโพ เขตยองดึงโพ กรุงโซล\nชั้น 13 ห้อง 11"
            }
        },
        "historySection": {
            "headingTitle": "ประวัติบริษัท",
            "history2024": "[บริการ] เปิดให้บริการ FlyOffice\n[โซลูชันเฉพาะทาง] พัฒนาระบบจัดการการจัดซื้อสำหรับ Seyeon Technology\n[โซลูชันเฉพาะทาง] ปรับปรุงระบบความร่วมมือทางการแพทย์ของมหาวิทยาลัย Dankook\n[โซลูชันเฉพาะทาง] พัฒนาระบบจัดการการชำระเงินฟิตเนสของโรงแรม Sheraton",
            "history2023": "[โซลูชันเฉพาะทาง] ปรับปรุงช่องโหว่ความปลอดภัยของระบบบริหารแรงงานโรงแรม Shilla\n[โซลูชันเฉพาะทาง] พัฒนาระบบจัดการศูนย์การค้ากลางกว่า 5,000 แห่ง\n[การบำรุงรักษา] บริการดูแลระบบบริหารบุคคลและเงินเดือน CAZ ประเทศไทย\n[โซลูชันเฉพาะทาง] พัฒนาแอปจัดส่งบัตร Magnet Service",
            "history2022": "[การสื่อสารอุปกรณ์] พัฒนาระบบรักษาความปลอดภัย Stealth Network\n[โซลูชันเฉพาะทาง] ระบบจัดการการยื่นภาษีของ USANA\n[การสื่อสารอุปกรณ์] พัฒนา RF Communication สำหรับรถเข็น Samsung Giheung\n[โซลูชันเฉพาะทาง] พัฒนาระบบนัดหมายการดูแลผิว USANA",
            "history2021": "[การสื่อสารอุปกรณ์] พัฒนาระบบสื่อสาร Runbox ของ SK Hynix จีน\n[การสื่อสารอุปกรณ์] พัฒนา Middleware Raspberry Pi สำหรับ LG Chem\n[โซลูชันเฉพาะทาง] พัฒนาเว็บไซต์จัดการแฟรนไชส์ CampingGorae\n[โซลูชันเฉพาะทาง] พัฒนาระบบ MES สำหรับ FRACO",
            "history2020": "[การสื่อสารอุปกรณ์] พัฒนาแอป RF Communication สำหรับโรงเรียนอนุบาล JT Communication\n[โซลูชันเฉพาะทาง] พัฒนาระบบจัดการหอพักมหาวิทยาลัย Daejin\n[การสื่อสารอุปกรณ์] ทดสอบกระบวนการผลิตกุญแจอิเล็กทรอนิกส์ IRevo\n[การสื่อสารอุปกรณ์] พัฒนา SECS Communication สำหรับเซิร์ฟเวอร์หลัก SK Hynix\n[โซลูชันเฉพาะทาง] พัฒนา B2B Shopping Mall สำหรับ Cheil Industries\n[โซลูชันเฉพาะทาง] พัฒนาระบบบริหารบุคคลและแรงงาน CAZ (ประเทศไทย)\n[โซลูชันเฉพาะทาง] พัฒนาระบบสัญญาอิเล็กทรอนิกส์ Hana Daetoo"
        },
        "logoSection": {
            "headingTitle": "คำอธิบายโลโก้",
            "logoMaster1": "'Free, Fly' หมายถึงวิวัฒนาการทางเทคโนโลยีและอิสรภาพในการบินอย่างอิสระ",
            "logoMaster2": "ด้วยโทนสีน้ำเงินที่ให้ความน่าเชื่อถือ แสดงถึงนวัตกรรมและพลังในเวลาเดียวกัน",
            "logoDetail1": "ข้อความ '2FC' ทางด้านซ้าย ผสมตัวเลข ‘2’ กับตัวอักษร ‘FC’ สื่อถึง ‘Second to none’ หรือสัญลักษณ์ของปีกที่ช่วยให้ธุรกิจโบยบินด้วยโซลูชัน IT",
            "logoDetail2": "เช่นเดียวกับชื่อ ‘Free Fly’ การออกแบบที่ให้ความรู้สึกเหมือนกำลังบินอย่างอิสระ แสดงถึงบริษัทที่มอบปีกให้ธุรกิจผ่านเทคโนโลยี",
            "logoDetail3": "ความแตกต่างระหว่างเส้นตรงและเส้นโค้งของตัวอักษร แสดงถึงความกลมกลืนระหว่างความมั่นคงและความยืดหยุ่นอย่างชัดเจน"
        }
    },
    "ServicePage": {
        "overviewSection": {
        "headingTitle": "บริการด้าน IT",
        "description": "2FC พัฒนาและดำเนินการทรัพยากร IT และระบบต่างๆ รวมข้อมูลและความรู้ให้มีประสิทธิภาพ และมุ่งเน้นการค้นหากลไกการเติบโตใหม่ของกลุ่มบริษัทในอนาคต รวมถึงการเพิ่มคุณค่าทางธุรกิจผ่านเทคโนโลยี IT ใหม่ๆ"
        },
        "projectIntroSection_1": {
        "title": "Fly Office",
        "summary": "ระบบรวมสำหรับการจัดซื้ออิเล็กทรอนิกส์ การสั่งซื้อ และการอนุมัติอิเล็กทรอนิกส์",
        "description": "คำขอจัดซื้อสำหรับวัสดุหรือสิ่งของที่จำเป็นจะถูกประมวลผลแยกตามผู้รับผิดชอบแต่ละโมดูล ได้แก่ การอนุมัติอิเล็กทรอนิกส์ การสั่งซื้อ การรับสินค้า ใบกำกับภาษี และการชำระเงิน"
        },
        "systemArchitectureSection_1": {
        "title": "แผนผังระบบ",
        "description": [
            "ตามสถานการณ์คำขอจัดซื้อ เช่น ใบกำกับภาษี (รับแล้ว), ใบกำกับภาษี (ยังไม่รับ), ค่าใช้จ่าย (รับแล้ว), ค่าใช้จ่าย (ยังไม่รับ) ระบบจะดำเนินการตามโมดูลที่เกี่ยวข้อง",
            "ระบบเชื่อมต่อกับกรมสรรพากรและบัญชีธนาคารเพื่อประมวลผล"
        ]
        },
        "keyFeatureSection_1": {
        "title": "คุณสมบัติหลัก",
        "description": [
            "เรามีบริการจัดการมาสเตอร์ดาต้าครอบคลุมการจัดการผู้จัดจำหน่าย การจัดการวัสดุ และกระบวนการจัดซื้อทั้งหมด",
            "สนับสนุนการจัดการคำขอจัดซื้ออย่างเป็นระบบเพื่อให้กระบวนการจัดซื้อมีประสิทธิภาพ",
            "ดำเนินการรวมงานจัดซื้อและรับสินค้า เช่น การจัดการใบสั่งซื้อ การจัดการการรับสินค้า และการดำเนินการรับสินค้า",
            "จัดการภาษีอย่างถูกต้องและรวดเร็วผ่านการประมวลผลใบกำกับภาษี",
            "สนับสนุนงานบัญชีทั้งหมด เช่น การจัดการการชำระเงิน คำขอชำระเงิน การปิดบัญชี และรายงานบัญชีแยกประเภททั่วไป"
        ]
        },
        "projectIntroSection_2": {
        "title": "การจัดการสมาชิกโรงแรม",
        "summary": "ระบบจัดการสมาชิกโรงแรม",
        "description": "บริการจัดการลูกค้าเพื่อการดูแลสมาชิก VIP ของโรงแรม"
        },
        "systemArchitectureSection_2": {
        "title": "แผนผังระบบ",
        "description": [
            "บริการปรับแต่งให้เหมาะสมกับสภาพแวดล้อมของลูกค้า",
            "จัดการความสัมพันธ์กับลูกค้าโรงแรมอย่างมีประสิทธิภาพ และช่วยปรับปรุงกลยุทธ์ทางธุรกิจ"
        ]
        },
        "keyFeatureSection_2": {
        "title": "คุณสมบัติหลัก",
        "description": [
            "สามารถกำหนดสินค้าแบบสมาชิก เช่น คะแนน คูปองส่วนลด และของขวัญฟรีได้อย่างอิสระตามคุณลักษณะของลูกค้า",
            "จัดการทรัพยากรที่ถูกจองไว้ได้อย่างมีประสิทธิภาพด้วย UI ที่ใช้งานง่าย",
            "ปรับระบบการดำเนินงานของสิ่งอำนวยความสะดวกให้เป็นระบบเพื่อเพิ่มประสิทธิภาพภายในองค์กร",
            "ลูกค้าสามารถใช้คะแนนเพื่อรับส่วนลดเมื่อใช้บริการ",
            "จัดการและรักษาความสัมพันธ์กับลูกค้าอย่างเป็นระบบเพื่อเพิ่มความภักดี",
            "วิเคราะห์สินค้าที่ลูกค้าชอบ รอบการซื้อ และพฤติกรรมการบริโภคเพื่อวางกลยุทธ์การตลาดแบบรายบุคคล"
        ]
        },
        "projectIntroSection_3": {
        "title": "การจัดการงานทีม",
        "summary": "การจัดการงานทีม",
        "description": "ให้บริการคุณภาพสูงผ่านการจัดการสัญญาลูกค้า งานเยี่ยมลูกค้า การจัดสรรทีมงาน และตารางงาน คำขอของลูกค้า เช่น งานยาแนวพื้นและผนัง การทำความสะอาด และปัญหาอาการบ้านใหม่ จะมีข้อมูลบันทึกคำสั่งซื้อ ตารางงาน และการจัดทีมงานรวมอยู่ด้วย การทำงานเหล่านี้ด้วยมือหรือ Excel ทำให้จัดการได้ยากและมีข้อจำกัดในการให้บริการคุณภาพสูงตามข้อมูลคำสั่งซื้อของลูกค้า"
        },
        "systemArchitectureSection_3": {
        "title": "แผนผังระบบ",
        "description": [
            "เมื่อคำสั่งของลูกค้าถูกบันทึก ระบบจะสร้างคำขอทำงานที่เหมาะสมกับบริการนั้นโดยอัตโนมัติ",
            "งานประเภทต่างๆ เช่น งานยาแนว ทำความสะอาดก่อนเข้าอยู่ และการแก้ปัญหาอาการบ้านใหม่ จะถูกจัดหมวดหมู่และจัดการอย่างเป็นระบบ",
            "ความคืบหน้าและผลลัพธ์จะแจ้งให้ลูกค้าทราบแบบเรียลไทม์ผ่าน SMS"
        ]
        },
        "keyFeatureSection_3": {
        "title": "คุณสมบัติหลัก",
        "description": [
            "เมื่อคำสั่งถูกบันทึก จะจัดสรรให้ทีมงานทันทีเพื่อการตอบสนองที่รวดเร็ว",
            "ทีมงานสามารถตรวจสอบตารางงานและข้อมูลงานได้อย่างชัดเจนผ่านปฏิทินงานเฉพาะ",
            "ปรับระบบการดำเนินงานของสิ่งอำนวยความสะดวกให้เป็นระบบเพื่อเพิ่มประสิทธิภาพงานในองค์กร",
            "หลังจากเสร็จงาน ภาพถ่ายหน้างานจะถูกบันทึกและข้อความแจ้งเสร็จงานจะถูกส่งให้ลูกค้าโดยอัตโนมัติ"
        ]
        }
    },
    "SolutionsPage": {
        "overviewSection": {
        "headingTitle": "โซลูชัน",
        "description": "เฟรมเวิร์กของ 2FC พัฒนามาจากเทคโนโลยีที่สั่งสมตลอด 13 ปีในการพัฒนาระบบหลากหลายด้าน และถูกนำมาให้บริการเป็นโซลูชันแบบปรับแต่งตามความต้องการขององค์กรต่างๆ"
        },
        "projectIntroSection_1": {
        "title": "ระบบบริหารจัดการแฟรนไชส์",
        "summary": "ระบบบริหารจัดการแฟรนไชส์",
        "description": "ระบบเดียวที่บริหารจัดการแฟรนไชส์กว่า 70 สาขา ครอบคลุมการสั่งซื้อ การจัดการสินค้า การรับซื้อ การขาย และการขายผ่าน POS\n\nสินค้าที่สาขาสั่งซื้อจะถูกแยกและสั่งไปยังผู้จัดส่งโดยอัตโนมัติ\nระบบเชื่อมต่อบัญชีธนาคารเพื่อจัดการวงเงินตามยอดสั่งซื้อของแต่ละสาขา"
        },
        "systemArchitectureSection_1": {
        "title": "ผังระบบ",
        "description": [
            "สำนักงานใหญ่แฟรนไชส์จัดการข้อมูลแคมป์และสินค้า ผ่าน WMS (ระบบจัดการคลังสินค้า), เว็บไซต์ และระบบจอง",
            "ระบบคลังสินค้าและโลจิสติกส์ทำหน้าที่จัดส่งสินค้าไปยังร้านแฟรนไชส์หรือแคมป์",
            "ร้านแฟรนไชส์ แคมป์ และผู้บริโภคสามารถสั่งซื้อสินค้าหรือใช้บริการผ่านระบบของสำนักงานใหญ่ ซึ่งจะมีการใช้งานและประสบการณ์จริงเกิดขึ้น"
        ]
        },
        "keyFeatureSection_1": {
        "title": "คุณสมบัติหลัก",
        "description": [
            "บริหารจัดการข้อมูลพื้นฐาน เช่น ลูกค้า สินค้า และแบบฟอร์มใบเสนอราคา รวมถึงสถานะคำสั่งซื้อ ยอดขาย และการรับชำระ เพื่อทำให้การขายเป็นระบบ",
            "ตรวจสอบสถานะการจัดส่งแต่ละคำสั่งได้แบบเรียลไทม์ และสามารถออกและจัดการใบกำกับภาษีได้",
            "จัดการคลังสินค้าและกระบวนการโลจิสติกส์ได้อย่างมีประสิทธิภาพ เช่น รายการรับชำระ การรับ–จ่ายสินค้า และการปรับสต็อก"
        ]
        },
        "projectIntroSection_2": {
        "title": "ระบบจัดการจัดซื้ออิเล็กทรอนิกส์",
        "summary": "ระบบจัดการจัดซื้ออิเล็กทรอนิกส์",
        "description": "คำขอจัดซื้อสำหรับวัสดุหรือสิ่งของที่จำเป็นจะถูกแยกประมวลผลตามผู้รับผิดชอบแต่ละโมดูล ได้แก่ การอนุมัติอิเล็กทรอนิกส์ การสั่งซื้อ การรับสินค้า ใบกำกับภาษี และการชำระเงิน"
        },
        "systemArchitectureSection_2": {
        "title": "ผังระบบ",
        "description": [
            "เมื่อมีการลงทะเบียนคำขอจัดซื้อ จะต้องได้รับอนุมัติผ่านระบบอนุมัติอิเล็กทรอนิกส์ และหลังจากนั้นจึงดำเนินการสั่งซื้อและรับสินค้า",
            "เมื่อการรับสินค้าเสร็จสมบูรณ์ ใบแจ้งหนี้จะถูกเชื่อมต่อและเข้าสู่ขั้นตอนการชำระเงิน โดยสามารถตรวจสอบสถานะการชำระเงินผ่านการเชื่อมต่อกับธนาคาร",
            "เมื่อการชำระเงินทั้งหมดเสร็จสิ้น ระบบบัญชีจะทำการตรวจสอบบัญชีขั้นสุดท้าย"
        ]
        },
        "keyFeatureSection_2": {
        "title": "คุณสมบัติหลัก",
        "description": [
            "แดชบอร์ดจะแสดงข้อมูลหลากหลาย เช่น ข่าวประกาศ ห้องเก็บเอกสาร สถานะคำขอจัดซื้อ เอกสารที่ต้องอนุมัติ และสถานะเอกสารของฉัน",
            "ผู้ใช้สามารถสร้างคำขอจัดซื้อ ป้อนข้อมูลสินค้า ปริมาณ และราคาต่อหน่วย และเชื่อมโยงการอนุมัติ การสั่งซื้อ การรับสินค้า และการออกใบกำกับภาษีได้",
            "แต่ละขั้นตอนมีปุ่มแยกต่างหาก ทำให้สามารถทำการอนุมัติ สั่งซื้อ รับสินค้า ประมวลผลใบแจ้งหนี้ และชำระเงินได้ง่ายด้วย UI ที่ใช้งานสะดวก",
            "หน้าจอเอกสารอนุมัติจะแสดงสถานะอนุมัติ ข้อมูลผู้อนุมัติ รายละเอียดเอกสาร และรายการสินค้าอย่างชัดเจน เพื่อให้บริหารประวัติการซื้อได้อย่างโปร่งใส",
            "ระบบทั้งหมดประมวลผลครบทุกขั้นตอน ตั้งแต่การจัดซื้อ การรับสินค้า การอนุมัติ ไปจนถึงการตรวจสอบบัญชี เพื่อเพิ่มประสิทธิภาพและความถูกต้องในการทำงาน"
        ]
        },
        "projectIntroSection_3": {
        "title": "ระบบบริหารจัดการแรงงานก่อสร้างต่างประเทศ",
        "summary": "ระบบจัดการแรงงาน",
        "description": "ระบบสำหรับบริษัทก่อสร้างโรงงานในประเทศไทย ใช้จัดการข้อมูลบุคลากรมากกว่า 500 คน และแรงงานกว่า 5,000 คน ครอบคลุมการลงเวลา การประเมินผลงาน และระบบประกวดราคาจัดซื้อ"
        },
        "systemArchitectureSection_3": {
        "title": "ผังระบบ",
        "description": [
            "ระบบ HR จัดการข้อมูลบุคลากร เช่น การลงทะเบียนบัตรประวัติ พื้นหลังการทำงาน การประเมิน และการย้ายตำแหน่ง",
            "ระบบบันทึกเวลาและการเข้างานรองรับการสแกนลายนิ้วมือ การทำงานประจำวัน OT กะกลางคืน และการทำงานวันที่ฝนตก",
            "ระบบเงินเดือนและการคำนวณรวมรองรับการตั้งค่ารายการเงินเดือนรายเดือน การคำนวณเงินเดือน และการจัดทำรายงานภาษี"
        ]
        },
        "keyFeatureSection_3": {
        "title": "คุณสมบัติหลัก",
        "description": [
            "สามารถตั้งค่าและจัดการรหัสกลางและบทบาทผู้ใช้ในภาพรวม ทำให้การดำเนินระบบมีความสอดคล้องและปลอดภัย",
            "รองรับการประมวลผลข้อมูลพนักงานมากกว่า 3,000 คน ทำให้การบริหารบุคคลในองค์กรขนาดใหญ่เป็นไปอย่างมีประสิทธิภาพ",
            "รองรับการปรับเปลี่ยนและคำนวณค่าต่างๆ เช่น ค่าแรงพื้นฐาน เบี้ยเลี้ยง และภาษี พร้อมทั้งสร้างรายงานเงินเดือนรายบุคคลได้ง่าย",
            "สามารถบันทึกข้อมูลการทำงานภายใต้เงื่อนไขต่างๆ เช่น OT กะกลางคืน และวันที่ฝนตก ทำให้บริหารงานตามสภาพจริงของไซต์งานได้อย่างยืดหยุ่น",
            "สลิปเงินเดือนและรายงานภาษีถูกสร้างขึ้นอัตโนมัติตามข้อมูลเงินเดือนและภาษีของแต่ละบุคคล ทำให้งานบัญชีและภาษีง่ายขึ้น"
        ]
        }
    },
    "DevicesPage": {
        "overviewSection": {
        "headingTitle": "Device \nCommunication",
        "description": "ในฐานะเป็นสาขาการพัฒนาเฉพาะทางของ 2FC เรามีประสบการณ์และผลงานมากมายในด้านการสื่อสาร RF, Raspberry Pi, มิดเดิลแวร์ต่างๆ และการสื่อสาร SECS ซึ่งสามารถช่วยยกระดับประสิทธิภาพการทำงานของบริษัทของท่านได้อย่างก้าวกระโดด"
        },
        "deviceProjectSection_1": {
        "title": "มิดเดิลแวร์ LG Energy Solution",
        "description": "คอนโทรลเลอร์ระบบ RFID ถูกออกแบบเพื่อการทำงานอัตโนมัติของกระบวนการผลิตแบตเตอรี่ โดยตรวจจับแพ็กเก็ตระหว่าง PLC และเครื่องอ่าน RFID แบบอัตโนมัติ และส่งต่อข้อมูลไปยังเครื่องอ่านที่ถูกต้อง รองรับเครื่องอ่านทั้งย่านความถี่ 13.56MHz และ 900MHz โดยเฉพาะแท็ก 900MHz จะมีการกรองค่าที่ถูกอ่านมากที่สุดต่อข้อมูลแต่ละรายการและส่งให้ PLC ข้อมูลที่รับ–ส่งทั้งหมดถูกบันทึกเป็นไฟล์ log ทำให้สามารถวิเคราะห์ปัญหาได้อย่างรวดเร็วและแม่นยำเมื่อเกิดเหตุขัดข้อง"
        },
        "deviceProjectSection_2": {
        "title": "มิดเดิลแวร์ SK hynix การสื่อสาร SECS",
        "description": "เพื่อทำให้กระบวนการ TDBI เป็นอัตโนมัติ ได้พัฒนาคอนโทรลเลอร์ Rack Stacker ที่ควบคุมการไหลของกระบวนการแบบ AGV มีการสร้างไลบรารีสื่อสารที่ทำงานบน Embedded Linux เพื่อความเสถียรของการส่ง–รับข้อความกับเซิร์ฟเวอร์ ใช้โปรโตคอล SECS-II บน HSMS เพื่อรองรับฟังก์ชันการเริ่มต้นอุปกรณ์และการรายงานเหตุการณ์ ออกแบบให้รองรับข้อกำหนดการสื่อสาร SECS และองค์ประกอบโปรโตคอลอย่างครบถ้วน เพื่อให้เชื่อมต่อกับอุปกรณ์กระบวนการเซมิคอนดักเตอร์ได้อย่างราบรื่น"
        },
        "deviceProjectSection_3": {
        "title": "การสื่อสารเข้ารหัส ZMODEM",
        "description": "เพื่อการทำงานอัตโนมัติของกระบวนการ TDBI ได้พัฒนาคอนโทรลเลอร์ Rack Stacker ที่ควบคุมการไหลของกระบวนการแบบ AGV โดยสร้างไลบรารีสื่อสารบน Embedded Linux เพื่อให้การรับ–ส่งข้อความกับเซิร์ฟเวอร์มีความเสถียร ใช้โปรโตคอล SECS-II บน HSMS รองรับฟังก์ชันการเริ่มต้นอุปกรณ์และรายงานเหตุการณ์ และออกแบบตามมาตรฐาน SECS เพื่อให้เชื่อมต่อกับอุปกรณ์กระบวนการเซมิคอนดักเตอร์ได้อย่างเหมาะสม"
        },
        "deviceProjectSection_4": {
        "title": "มิดเดิลแวร์ชั้นวาง Runbox โรงงาน Ushi SK System IC",
        "description": "คอนโทรลเลอร์ชั้นวางที่ออกแบบเพื่อการลำเลียง Runbox ซึ่งใส่เวเฟอร์ในกระบวนการผลิตเซมิคอนดักเตอร์ จะสื่อสารกับเซิร์ฟเวอร์ผ่าน RS-485 Gateway และควบคุมเครื่องอ่าน RFID 125kHz และโมดูล LCD ข้อมูลเข้า–ออกของ Runbox และสถานะระบบถูกบันทึกแบบเรียลไทม์ และข้อมูลที่รับ–ส่งทั้งหมดถูกจัดเก็บเป็นไฟล์ log เพื่อให้สามารถวิเคราะห์ปัญหาได้อย่างรวดเร็วเมื่อเกิดเหตุขัดข้อง"
        },
        "deviceProjectSection_5": {
        "title": "มิดเดิลแวร์รถเข็นอัตโนมัติ LOT Location Samsung Giheung",
        "description": "คอนโทรลเลอร์รถเข็นที่ออกแบบเพื่อการลำเลียง LOT Box ที่ใส่เวเฟอร์ในกระบวนการผลิตเซมิคอนดักเตอร์ ใช้การสื่อสารแบบไร้สายผ่าน Wi-Fi เนื่องจากเป็นอุปกรณ์เคลื่อนที่ คอนโทรลเลอร์ควบคุมเครื่องอ่าน RFID 13.56MHz ไฟสัญญาณ เซนเซอร์ และโมดูล LCD ตรวจจับสถานะกระบวนการแบบเรียลไทม์และแสดงข้อมูลให้ผู้ใช้ ข้อมูลรับ–ส่งทั้งหมดถูกบันทึกเป็นไฟล์ log เพื่อช่วยวิเคราะห์สาเหตุและแก้ปัญหาได้อย่างรวดเร็ว"
        },
        "deviceProjectSection_6": {
        "title": "แอปสื่อสารเครื่องอ่าน RF ของ JT Communication",
        "description": "เพื่อควบคุมเครื่องอ่าน RFID ที่ติดตั้งบริเวณทางเข้าโรงเรียนอนุบาลและเนิร์สเซอรี เราได้พัฒนาแอป Android สำหรับตั้งค่าระบบ ซึ่งเป็นส่วนหนึ่งของระบบแจ้งข้อมูลเวลาเข้า–ออกของเด็กให้ผู้ปกครอง แอปจะสื่อสารกับเครื่องอ่าน RFID ผ่าน Bluetooth และสามารถตั้งค่าการทำงานทั้งหมดของเครื่องอ่านผ่านแอปโดยตรง รวมถึงรองรับการอัปเดตเฟิร์มแวร์และการทดสอบการอ่านแท็ก ทำให้งานบำรุงรักษาหน้างานทำได้อย่างสะดวก"
        },
        "deviceProjectEtc": {
        "title": "กรณีการพัฒนาอื่นๆ",
        "descriptions_left": [
            "การเชื่อมต่อ Icheon TDBI Buffer Manager",
            "พัฒนาระบบตรวจจับแรงดึง ศูนย์วัฒนธรรมเอเชีย กวางจู",
            "อินเทอร์เฟซ Seyeon Reel Finder",
            "การสื่อสาร SK hynix",
            "การจัดการทดสอบผลิตภัณฑ์ iRevo",
            "โปรแกรมสื่อสารบริษัทบัตร HanSeung"
        ],
        "descriptions_right": [
            "พัฒนา Raspberry Terra",
            "Hynix Reticle",
            "ทดสอบกระบวนการผลิตกุญแจอิเล็กทรอนิกส์ iRevo",
            "การสื่อสาร SECS กับเซิร์ฟเวอร์หลัก Hynix",
            "ประมวลผลภาพสินค้าเกษตร Haman"
        ]
        }
    }





}